Repository: wp-plugins/fpw-category-thumbnails
Catalog: languages/fpw-fct-*.po
Languages: pl_pl

source: ALL
pl_pl: WSZYSTKICH

source: Action Buttons
pl_pl: Przyciski Działań

source: Add this plugin to the Admin Bar
pl_pl: Dodaj tę wtyczkę do Paska Administratora

source: All thumbnails removed successfully.
pl_pl: Wszystkie ikony zostały pomyślnie usunięte.

source: Answer:
pl_pl: Odpowiedź:

source: Applied thumbnails to existing posts / pages successfully.
pl_pl: Dodanie ikon do istniejących wpisów / stron zakończyło się pomyślnie.

source: Apply Mapping
pl_pl: Zastosuj przyporządkowania

source: Are you sure you want to clear this ID?
pl_pl: Czy z pewnością chcesz wyczyścić ten ID?

source: Are you sure you want to proceed?
pl_pl: Czy z pewnością chcesz to wykonać?

source: Author
pl_pl: Autor

source: Author picture
pl_pl: Zdjęcie autora

source: Available Options
pl_pl: Dostępne Ustawienia

source: Cancel
pl_pl: Anuluj

source: Categories
pl_pl: Kategorii

source: Category (ID)
pl_pl: Kategoria (ID)

source: Clear
pl_pl: Wyczyść

source: Do not overwrite if post / page has thumbnail assigned already
pl_pl: Nie nadpisuj, jeśli wpis / strona ma już przydzieloną ikonę

source: Donate
pl_pl: Wspomóż

source: Each row of the mapping table represents a category and a thumbnail image ID assigned to it.
pl_pl: Każdy rząd tabeli przyporządkowań reprezentuje kategorię i ID obrazka jej przydzielonego.

source: Enable JavaScript and enjoy fully AJAX powered interface!
pl_pl: Włącz JavaScript, aby cieszyć się w pełni wspomaganym przez AJAX środowiskiem.

source: FAQ
pl_pl: Często Zadawane Pytania

source: FPW Category Thumbnails
pl_pl: Ikony Kategorii FPW

source: FPW Plugins
pl_pl: Wtyczki FPW

source: File names of authors' pictures in NextGen gallery must follow this naming convention: 'id.jpg' where 'id' is author's user id.
pl_pl: Nazwy plików zdjęć autorów w galerii NextGen mają następujący format: 'id.jpg', gdzie 'id' jest to id użytkownika.

source: File names of authors' pictures in media library must follow this naming convention: 'autor_id.jpg' where 'id' is author's user id.
pl_pl: Nazwy plików zdjęć autorów muszą być w następującym formacie formacie: 'author_id.jpg' gdzie 'id' oznacza ID użytkownika autora.

source: First column holds a category name and its ID.
pl_pl: Pierwsza kolumna zawiera nazwę kategorii i jej ID.

source: Frequently Asked Questions
pl_pl: Często Zadawane Pytania

source: Get ID
pl_pl: Pobierz ID

source: Get ID, Clear, and Refresh buttons. Third column holds thumbnail's preview.
pl_pl: i przyciski Pobierz ID, Wyczyść i Podgląd.

source: Get Image ID
pl_pl: Pobierz ID Obrazka

source: Get Language File
pl_pl: Pobierz Plik Językowy

source: Help
pl_pl: Pomoc

source: Help for FPW Category Thumbnails
pl_pl: Pomoc dla wtyczki Ikony Kategorii FPW

source: How to use 'fpwCategoryThumbnails::addThumbnailToPost' method?
pl_pl: W jaki sposób używać metodę 'fpwCategoryThumbnails::addThumbnailToPost'?

source: I got an ID for the image and assigned it to the category, and the plugin does not display it in posts.
pl_pl: pobrałem ID obrazka i przporządkowałem go do kategorii, niestety wtyczka nie wyświetla ikony we wpisach.

source: I've entered ID of a picture from NextGen Gallery and thumbnail doesn't show.
pl_pl: Wprowadziłem ID obrazka z galerii NextGen a ikona nie pokazuje się.

source: IDs from NextGen Gallery must be entered with ngg- prefix, so ID 230 should be entered as ngg-230.
pl_pl: ID z galerii NextGen musi być wprowadzone z przedrostkiem ngg-, tak więc ID 230 powinien być wprowadzony jako ngg-230.

source: Image ID
pl_pl: ID Obrazka

source: Image ID can be entered manually ( if you remember it ) or by clicking on 'Get ID' button which will call 'media upload' overlay.
pl_pl: ID obrazka może być wprowadzone bezpośrednio ( jeśli go pamiętamy ) lub z użyciem przycisku 'Pobierz ID', który spowoduje wywołanie nakładki 'media upload'.

source: In this state you have to enter
pl_pl: W tym trybie konieczne jest bezpośrednie wprowadzanie wartości do pola

source: Inactive button - presentation only
pl_pl: Nieaktywny przycisk - jako przykład

source: Introduction
pl_pl: Wprowadzenie

source: JavaScript is disabled!
pl_pl: JavaScript jest wyłączony!

source: Language file already exists.
pl_pl: Plik językowy już istnieje.

source: Language file downloaded successfully. It will be applied as soon as this page is reloaded.
pl_pl: Plik językowy ściągnięto pomyślnie. Będzie on zastosowany po odświeżeniu strony.

source: Language file downloaded. Click
pl_pl: Pobrano plik językowy. Kliknij

source: Language file for this version is not yet available.
pl_pl: Plik językowy dla tej wersji nie jest jeszcze dostępny.

source: Language file is already installed.
pl_pl: Plik językowy jest już zainstalowany.

source: Language file is not available.
pl_pl: Plik językowy nie jest dostępny.

source: Look into
pl_pl: Obejrzyj

source: Mapping
pl_pl: Przyporządkowania

source: Mapping & Actions
pl_pl: Przyporządkowania i Działania

source: Media Library: picture not found!
pl_pl: Biblioteka Mediów: nie znaleziono obrazka!

source: More information
pl_pl: Dodatkowe informacje

source: NextGen Gallery: not active!
pl_pl: Wtyczka NextGen Gallery nie jest aktywna!

source: NextGen Gallery: picture not found!
pl_pl: NextGen Gallery: nie znaleziono obrazka!

source: Note
pl_pl: Uwaga

source: Option
pl_pl: Ustawienie

source: Options
pl_pl: Ustawienia

source: Options updated successfully.
pl_pl: Ustawienia zapisano z pomyślnie.

source: Picture
pl_pl: Zdjęcie

source: Please confirm
pl_pl: Proszę potwierdzić

source: Please remember that the active theme must support post thumbnails.
pl_pl: Proszę pamiętać, iż aktywny motyw musi wspomagać ikony wpisów.

source: Plugin's site
pl_pl: Witryna wtyczki

source: Preview
pl_pl: Podgląd

source: Question:
pl_pl: Pytanie:

source: Read this article
pl_pl: Przeczytaj artykuł

source: Refresh
pl_pl: Odśwież

source: Remember to click on
pl_pl: Pamiętaj, aby kliknąć na

source: Remove Thumbnails
pl_pl: Usuń Ikony

source: Remove plugin's data from database on uninstall
pl_pl: Usuń dane wtyczki z bazy danych podczas usuwania wtyczki

source: Screen Options
pl_pl: Opcje Ekranu

source: Second column consists of four elements: Image ID - an input field which holds thumbnail's image ID,
pl_pl: Druga kolumna to ID Obrazka - pole do wprowadzania ID ikony.

source: Setting featured images for posts / pages could be very time consuming,
pl_pl: Ustawianie ikon dla wpisów / stron może być bardzo czasochłonne,

source: Settings
pl_pl: Ustawienia

source: Support
pl_pl: Wspomaganie

source: That makes the functionality of table row actions
pl_pl: Degraduje to funkcjonalność akcji rzędów tabeli.

source: The name of NextGen gallery must be 'authors'.
pl_pl: Nazwą galerii NextGen musi być 'authors'.

source: The plugin does not display thumbnails by itself. This is your theme's role.
pl_pl: Wyświetlanie ikon nie jest zadaniem wtyczki. Motyw wyświetla ikony.

source: This action
pl_pl: To działanie

source: This action will add thumbnails based on current settings to
pl_pl: To działanie spowoduje dodanie ikon na podstawie bieżących przyporządkowań do

source: This plugin automates the process by inserting a thumbnail based on category / thumbnail mapping while post / page is being created or updated.
pl_pl: Wtyczka automatyzuje ten proces poprzez dodawanie ikony na podstawie przyporządkowań kategoria / ikona, gdy wpis jest tworzony lub uaktualniany.

source: Update
pl_pl: Aktualizuj

source: Upload authors' pictures into media library or NextGen gallery.
pl_pl: Wyślij zdjęcia autorów do biblioteki mediów lub galerii NextGen.

source: Very often we select the same thumbnail for posts in particular category.
pl_pl: Bardzo często wybieramy tę samą ikonę dla wpisów należących do określonej kategorii.

source: WILL NOT
pl_pl: NIE BĘDZIE

source: WILL REMOVE
pl_pl: USUNIE

source: Warning
pl_pl: Ostrzeżenie

source: What is required to use authors' pictures as thumbnails?
pl_pl: Jakie są wymagania konieczne do użycia zdjęć autorów jako ikon?

source: What's new in this version?
pl_pl: Co nowego w tej wersji?

source: You did not send any credentials!
pl_pl: Nie wysłałe(a)ś żadnych poświadczeń!

source: You did not send the right credentials!
pl_pl: Nie wysłałe(a)ś poprawnych poświadczeń!

source: about enabling theme's support for post thumbnails.
pl_pl: , na temat udostępniania wspomagania dla ikon wpisów.

source: add post thumbnail to every existing post / page belonging to the category which has thumbnail id mapped to
pl_pl: dodaj ikonę do każdego wpisu / strony należącego do kategorii z przyporządkowaną ikoną

source: adds thumbnails to existing posts / pages based on category mapping
pl_pl: dodaje ikony do istiejących wpisów i stron na podstawie przyporządkowań kategorii

source: and contextual
pl_pl: , a także

source: be respected!
pl_pl: uwzględniane!

source: before switching to another page!
pl_pl: przed zmianą strony!

source: being degraded. Other actions are affected too.
pl_pl: Dotyczy to także innych akcji.

source: button to save changes.
pl_pl: , aby zachować zmiany.

source: by
pl_pl: , którego autorem jest

source: checked
pl_pl: zaznaczone

source: clear Image ID and Preview fields
pl_pl: wyczyść pola 'ID Obrazka' i 'Podgląd'

source: download language file for current version
pl_pl: ściągnij plik językowy dla bieżącej wersji wtyczki

source: during uninstall procedure all plugin's information ( options, mappings ) will be removed from the database
pl_pl: w trakcie usuwania wtyczki wszystkie jej dane ( ustawienia, przyporządkowania ) zostaną usunięte z bazy danych

source: especially when your media library holds hundreds of pictures.
pl_pl: szczególnie, gdy biblioteka mediów zawiera setki obrazków.

source: existing posts / pages.
pl_pl: istniejących wpisów / stron.

source: get thumbnail's picture ID from media library
pl_pl: pobierz ID ikony z biblioteki mediów

source: here
pl_pl: tutaj,

source: refresh Preview field after manual changes to Image ID field
pl_pl: odśwież pole 'Podgląd' po wprowadzeniu nowej wartości do pola 'ID Obrazka'

source: remove thumbnails from all existing posts / pages regardless of the category
pl_pl: usuń ikony ze wszystkich istniejących wpisów / stron bez względu na kategorię

source: removes thumbnails from all posts /pages regardless of the category
pl_pl: usuwa ikony ze wszystkich wpisów / stron

source: saves modified options and mapping to the database
pl_pl: zapisuje zaktualizowane ustawienia i przyporządkowania do bazy danych

source: screen will not be visible.
pl_pl: kontekstowa nie będą dostępne.

source: set author's picture as thumbnail
pl_pl: użyj zdjęcia autora jako ikony

source: the content of the table's current page.
pl_pl: zostaną zachowane.

source: the plugin's link to its settings page will be added to the Admin Bar
pl_pl: odnośnik do ustawień wtyczki zostanie dodany do Paska Administratora

source: thumbnails from
pl_pl: ikony ze

source: to reload page.
pl_pl: aby odświeżyć stronę.

source: topic of Documentation.
pl_pl: temat Dokumentacji.

source: values manually and click on any row action link or
pl_pl: i kliknięcie na jakikolwiek odnośnik akcji rzędu lub przycisk

source: when clicked after entering of an image ID manually it will populate 'Preview' area ( AJAX - without reloading screen )
pl_pl: kliknięcie po bezpośrednim wprowadzeniu ID obrazka spowoduje wyświetlnie ikony w polu 'Podgląd' ( AJAX - bez przeładowania strony )

source: which controls number of categories per page
pl_pl: kontrolujące ilość kategorii na stronę

source: while the post is being saved the originally set thumbnail will be preserved
pl_pl: gdy wpis jest uaktualniany, oryginalnie ustawiona ikona pozostanie nienaruszona

source: will assign author's picture as a thumbnail for the category
pl_pl: przyporządkuje zdjęcie autora jako ikonę do kategorii

source: will be respected.
pl_pl: będzie uwzględnione.

source: will call 'media upload' overlay and on return will populate 'Image ID' input box and 'Preview' area ( AJAX - without reloading screen )
pl_pl: wywoła nakładkę 'media upload' i po powrocie wypełni pola 'ID Obrazka' i 'Podgląd' ( AJAX - bez przeładowania strony )

source: will enter '0' as image ID and clear 'Preview' area ( AJAX - without reloading screen )
pl_pl: wyzeruje pole ID Obrazka i wyczyści pole 'Podgląd' ( AJAX - bez przeładowania strony )

source: without JavaScript the only mapping saved on submit will be
pl_pl: bez aktywnego JavaScript jedynie przyporządkowania bieżącej strony tabeli

source: write modified options and mapping to the database
pl_pl: zapisz zaktualizowane ustawienia i przyporządkowania do bazy danych

source: No changes. Nothing to update.
pl_pl: Nie wykryto żadnych zmian.

source: No changes detected. Nothing to update.
pl_pl: Nie wykryto żadnych zmian.

source: Please wait...
pl_pl: Proszę czekać...

source: Values copied from the right to the left panel.
pl_pl: Przekopiowano prawy panel do lewego.

source: Values copied from the left to the right panel.
pl_pl: Przekopiowano lewy panel to prawego.

source: Language file is already installed. Please reload this page.
pl_pl: Plik językowy jest już zainstalowany. Proszę odświeżyć stronę.

source: Validation failed!
pl_pl: Wykryto błędy danych!

source: FPW Post Thumbnails
pl_pl: Ikony Wpisów FPW

source: In Content panel field
pl_pl: W panelu Wpisów pole

source: contains non-numeric characters.
pl_pl: zawiera znaki nienumeryczne.

source: In Excerpt panel field
pl_pl: W panelu Wypisów pole

source: must start with '#' charcter followed by 6 hexadecimal digits.
pl_pl: musi składać się ze znaku '#' i następujących po nim sześciu cyfr w systemie szesnastkowym

source: load language file for your version
pl_pl: załąduj plik językowy dla bieżącej wersji

source: Content thumbnails enabled:
pl_pl: Ikony Wpisów włączone:

source: copy all values to the right panel
pl_pl: kopiuj dane tego panelu do prawego panelu

source: Copy
pl_pl: Kopiuj

source: Content - Preview
pl_pl: Wpis - Podgląd

source: Excerpt thumbnails enabled:
pl_pl: Ikony Wypisów włączone:

source: copy all values to the left panel
pl_pl: kopiuj dane tego panelu do lewego panelu

source: Excerpt - Preview
pl_pl: Wypis - Podgląd

source: now called
pl_pl: nazywanych teraz

source: Some themes provide such support but do not display them.
pl_pl: Niektóre motywy zapewniają wspomaganie lecz nie wyświetlają ikon.

source: Then we have three choices.
pl_pl: Mamy wtedy trzy alternatywne rozwiązania.

source: First is to find another theme supporting and displaying thumbnails, second - forget about thumbnails, and the third is to get our hands dirty. The last one requires modifications to the current theme's files ( not very elegant and practical as the next theme's upgrade will wipe out those modifications ) or at least creating a child theme.
pl_pl: Pierwszym jest znalezienie innego motywu wspomagającego ikony, drugim jest zrezygnowanie z ikon, a trzecim jest wykonanie pewnej pracy. Ostatnie wymaga modyfikacji plików motywu ( niezbyt eleganckie i niepraktyczne, biorąc pod uwagę, że kolejna aktualizacja motywu nadpisze nasze zmiany ) lub też utworzenia motywu podrzędnego ( child theme ).

source: plugin makes these choices obsolete. It will add support for thumnails, display them, and give you more control over their appearance.
pl_pl: czyni te rozwiązania niepotrzebnymi. Doda ona wpomaganie ikon, wyświetli je i umożliwi większą kontrolę ich wyglądu.

source: And what's most important it will not modify the current theme in any way.
pl_pl: Najważniejsze jest to, że nie dokona ona żadnych zmian w plikach motywu.

source: General
pl_pl: Ogólne

source: if checked then plugin's link to settings page will be added to the Admin Bar
pl_pl: jeśli włączone to łącznik do ustawień wtyczki zostanie dodany do Paska Administratora

source: Panels
pl_pl: Panele

source: Thumbnails for Content enabled:
pl_pl: Ikony dla Wpisów włączone:

source: if checked then enables thumbnails for contents
pl_pl: jeśli zaznaczone to zostaną włączone ikony dla wpisów

source: Thumbnails for Excerpt enabled:
pl_pl: Ikony dla Wypisów włączone:

source: if checked then enables thumbnails for excerpts
pl_pl: jeśli zaznaczone to włączone zostaną ikony dla wypisów

source: and
pl_pl: i

source: width and height of the thumbnail
pl_pl: szerokość i wysokość ikony

source: position of the thumbnail relative to the content ( excerpt )
pl_pl: pozycja ikony w stosunku do treści wpisu ( wypisu )

source: if checked then the thumbnail will have a border and next four parameters will be applied
pl_pl: jeśli zaznaczone to ikona będzie miała ramkę a kolejne cztery parametry będą uwzględnione

source: if > 0 then the border will have rounded corners with the radius of corners in pixels equal to the specified value
pl_pl: jeśli > 0 to ramka będzie miała zaokrąglone narożniki a ich promień w pikselach będzie równy podanej wartości

source: thickness of the border in pixels
pl_pl: grubość ramki w pikselach

source: color of the border
pl_pl: kolor ramki

source: thumbnail's background color
pl_pl: kolor tła ikony

source: these are standard padding and margin parameters
pl_pl: standardowe parametry wypełniania i marginesu

source: Can I use this plugin if my theme supports and displays thumbnails?
pl_pl: Czy mogę używać tej wtyczki, gdy motyw wspmaga i wyświetla ikony?

source: If the theme displays thumbnails for both the content and excerpts I would not recommended it as you would get two thumbnails displayed. However I can imagine one exception. The theme displays thumbnails for full content but not for excerpts or the other way around. The plugin will display thumbnails for the part not being displayed by the theme not adding thumbnails to the other part.
pl_pl: Nie zalecałbym tego, jeśli motyw wyświetla ikony dla wpisów i wypisów, ponieważ wyświetlane będą dwie ikony. Jednak w sytuacji, gdy motyw wyświetla ikony tylko dla jednego typu - wpisy lub wypisy, wtyczka może być użyta do wyświetlania tych ikon, których nie wyświetla motyw.

source: Help for FPW Post Thumbnails
pl_pl: Pomoc dla wtyczki Ikony Wpisów FPW

source: Changed data saved successfully.
pl_pl: Zapisano zmiany pomyślnie.

source: write modified data to the database
pl_pl: zapisz zmienione dane do bazy danych

source: There are many nice themes not providing any support for
pl_pl: Jest wiele ładnych motywów nie wspomagających jednak

source: Enable FPW Post Thumbnails
pl_pl: Włącz Ikony Wpisów FPW

source: Added option to enable / disable built-in FPW Post Thumbnails
pl_pl: Dodano wybór włączania / wyłączania dołączonej wtyczki Ikony Wpisów FPW

source: No changes
pl_pl: Bez zmian
